cask_args appdir: '/Applications'

# Terminal support applications
brew 'wget'
brew 'tmux'
brew 'mtr'
brew 'watch'
brew 'ssh-copy-id'
brew 'mas' # to install apps from AppStore
brew 'lnav' # log analysis terminal app
brew 'pstree'
cask 'iterm2'
brew 'zsh'
brew 'zsh-completions'
brew 'ack'
brew 'htop'
brew 'libjpeg-turbo'
brew 'zlib'
brew 'cmake'

# Coding applications
cask 'visual-studio-code'
cask 'visualvm'
cask 'wireshark'
cask 'soapui'
cask 'sequel-pro'
brew 'vim'
cask 'kdiff3'
cask 'launchrocket'
cask 'intellij-idea'

# Cloud related
cask 'docker'
brew 'docker-completion'
brew 'docker-compose'
brew 'docker-compose-completion'
cask 'minishift'
brew 'kubernetes-cli'
brew 'openshift-cli'
brew 'heroku'
cask 'vagrant'
brew 'vagrant-completion'
brew 'packer'
brew 'packer-completion'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Architecture apps
cask 'archi'
cask 'xmind'

# Web applications
cask 'google-chrome'

# OSX customisations
cask 'smcfancontrol'
cask 'turbo-boost-switcher'
cask 'karabiner-elements'
mas 'sysinfo', id: 892050289
cask 'mattr-slate'

# additional fonts
tap 'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-droid-serif'

# Communication apps
cask 'joinme'
cask 'viber'
cask 'slack'
cask 'skype'
mas 'airmail-3', id: 918858936
mas 'mailraider-pro', id: 765096886

# Other
cask 'kindle'
mas 'Pixelmator', id: 407963104 
cask 'djview'
mas 'simple-mouse-locator', id: 946676425
mas 'decompressor', id: 1033480833
mas 'microsoft-remote-desktop-8-0', id: 715768417
mas 'project-viewer-365', id: 742239147

## Programming languages
# Java, Scala is based on sdkman
brew 'rust'
cask 'anaconda'
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'ctags' # necessary for Python

# file sharing apps
mas 'onedrive', id: 823766827
cask 'dropbox'
cask 'google-drive-file-stream'