cask_args appdir: '/Applications'

# Terminal support applications
brew 'wget'
brew 'tmux'
brew 'mtr'
brew 'watch'
brew 'ssh-copy-id'
brew 'mas' # to install apps from AppStore
brew 'lnav' # log analysis terminal app
brew 'pstree'
cask 'iterm2'
brew 'zsh'
brew 'zsh-completions'
brew 'ack'
brew 'htop'
brew 'libjpeg-turbo'
brew 'zlib'
brew 'cmake'
brew 'telnet'
brew 'midnight-commander'
brew 'zsh-autosuggestions'
brew 'p7zip'
brew 'wakeonlan'
brew 'fswatch'
brew 'jq'
brew 'pv'
brew 'kafkacat'

# IDEs, software engineering applications
cask 'visual-studio-code'
cask 'visualvm'
cask 'wireshark'
cask 'soapui'
cask 'dbeaver-community'
brew 'mysql-client'
brew 'vim'
cask 'kdiff3'
cask 'launchrocket'
cask 'intellij-idea'
brew 'jhipster'
cask 'jprofiler'
brew 'travis'
cask 'postman'
brew 'dnsmasq'
brew 'jmeter'
brew 'infer'

# Raspberry
cask 'sdformatter'

# Cloud related
cask 'docker'
brew 'docker-completion'
brew 'docker-compose-completion'
cask 'minishift'
cask 'minikube'
brew 'kubernetes-cli'
brew 'openshift-cli'
tap 'heroku/brew'
brew 'heroku'
cask 'vagrant'
brew 'vagrant-completion'
brew 'packer'
brew 'packer-completion'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
brew 'certbot'
brew 'terraform'
brew 'kubernetes-helm'
brew 'awscli'
brew 'azure-cli'

# Architecture apps
cask 'archi'
cask 'xmind'
brew 'graphviz'
brew 'adr-tools'

# Web applications
cask 'google-chrome'
cask 'firefox'
cask 'send-to-kindle'

# OSX customisations
cask 'smcfancontrol'
cask 'turbo-boost-switcher'
cask 'karabiner-elements'
mas 'sysinfo', id: 892050289
cask 'mattr-slate'
cask 'balenaetcher'

# additional fonts
tap 'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-droidsansmono-nerd-font'
cask 'font-droidsansmono-nerd-font-mono'

# Communication apps
cask 'viber'
cask 'slack'
cask 'skype'
mas 'airmail-3', id: 918858936
mas 'mailraider-pro', id: 765096886
mas 'telegram', id: 747648890
cask 'microsoft-teams'

# Other
cask 'kindle'
mas 'Pixelmator', id: 407963104 
cask 'djview'
cask 'cyberduck'
cask 'mpv'
mas 'simple-mouse-locator', id: 946676425
mas 'decompressor', id: 1033480833
mas 'microsoft-remote-desktop-10', id: 1295203466
mas 'project-viewer-365', id: 742239147
cask 'krisp'

## Programming languages
# Java, Scala is based on sdkman
brew 'rust'
cask 'miniconda'
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'ctags' # necessary for Python
brew 'nodenv'
brew 'python'

# file sharing apps
mas 'onedrive', id: 823766827
cask 'dropbox'
cask 'google-drive-file-stream'

# compilation support
brew 'llvm'
brew 'boost'
brew 'hdf5'
