cask_args appdir: '/Applications'

# Terminal support applications
brew 'wget'
brew 'tmux'
brew 'mtr'
brew 'watch'
brew 'ssh-copy-id'
brew 'mas' # to install apps from AppStore
brew 'lnav' # log analysis terminal app
brew 'pstree'
cask 'iterm2'
brew 'zsh'
brew 'zsh-completions'
brew 'ack'
brew 'htop'
brew 'libjpeg-turbo'
brew 'zlib'
brew 'cmake'
brew 'telnet'
brew 'midnight-commander'
brew 'zsh-autosuggestions'
brew 'p7zip'
brew 'wakeonlan'
brew 'fswatch'
brew 'jq'
brew 'pv'
brew 'kcat'
brew 'httpie'

# IDEs, software engineering applications
cask 'visual-studio-code'
cask 'visual-studio'
cask 'visualvm'
cask 'wireshark'
cask 'temurin'
cask 'dbeaver-community'
brew 'mysql-client'
brew 'vim'
cask 'kdiff3'
cask 'launchrocket'
cask 'intellij-idea'
brew 'jhipster'
brew 'travis'
cask 'postman'
brew 'dnsmasq'
brew 'jmeter'
brew 'infer'
cask 'ngrok' # Reverse proxy, secure introspectable tunnels to localhost
brew 'iredis'

# Raspberry
cask 'sdformatter'

# Cloud related
cask 'docker'
brew 'docker-completion'
# brew 'docker-compose-completion'
cask 'minishift'
brew 'minikube'
brew 'kubernetes-cli'
brew 'openshift-cli'
tap 'heroku/brew'
brew 'heroku'
cask 'vagrant'
brew 'vagrant-completion'
brew 'packer'
brew 'packer-completion'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
brew 'certbot'
brew 'terraform'
brew 'helm'
brew 'awscli'
brew 'azure-cli'
cask 'microsoft-azure-storage-explorer'
cask 'google-cloud-sdk'
tap 'azure/functions'
brew 'azure/functions/azure-functions-core-tools@4'
brew 'firebase-cli'

# Architecture apps
# cask 'archi'
cask 'xmind'
brew 'graphviz'
brew 'adr-tools'
cask 'drawio'

# Web applications
cask 'google-chrome'
cask 'send-to-kindle'

# OSX customisations
cask 'smcfancontrol'
cask 'turbo-boost-switcher'
cask 'karabiner-elements'
mas 'cpu-led', id: 448189857
cask 'hammerspoon'
cask 'balenaetcher'

# additional fonts
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-roboto-slab'
cask 'font-roboto'
cask 'font-roboto-serif'

# Communication apps
cask 'viber'
cask 'slack'
cask 'skype'
mas 'mailraider-pro', id: 765096886
mas 'telegram', id: 747648890
cask 'microsoft-teams'
cask 'whatsapp'

# Other
cask 'kindle'
mas 'Pixelmator', id: 407963104 
cask 'djview'
cask 'cyberduck'
cask 'mpv'
mas 'simple-mouse-locator', id: 946676425
mas 'decompressor', id: 1033480833
mas 'microsoft-remote-desktop-10', id: 1295203466
mas 'project-viewer-365', id: 742239147
cask 'stellarium'
cask 'the-unarchiver'

## Programming languages
# Java, Scala is based on sdkman
brew 'rust'
cask 'miniconda'
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'ctags' # necessary for Python
brew 'nodenv' # JavaScript toolchain manager
brew 'python'
brew 'dotnet@6'

# file sharing apps
cask 'dropbox'
cask 'google-drive'

# compilation support
brew 'llvm'
brew 'boost'
brew 'hdf5'
